var my_resume = {
  "Name"  : "shanmukha",
  "Phone" : "9986125185",
	"Email" : "shanmukr.sw@gmail.com",
  "Experience" : "Having 1.8 years experience in IT industry., Mindteck India Pvt ltd from Aug-2015 to Mar-2016., Mirafra software technologies from Oct-2016 to till-date.",
  "Technologies" : "ruby, rails, perl, python, git, storage, mysql, postgres",
  "Education" : "DR SGIET from 2010 to 2014, Sri chaitanya junior college from 2008 to 2010, pragathi vidhya nilayam from 2004 to 2008",
  "Projects" : [
                 { 
                   "Project Name" : "Mirafra Recruitment App",
                   "Description" : "Website to handle the recruitment process in Mirafra Technologies.  It acts as central repository for all the requirements in the company and match them with the possible candidates. Website connects managers, recruiters and interviewers and helps in co-ordinating the interviews. The requirement owner can shortlist the resumes. It allows the recruiters to schedule the interviews between the candidate and interviewers.",
                   "Responsibilities" : "Sole developer and maintainer and tester for the entire website., Ported the entire website from Ruby 1.9.3 and Rails 2.3.18 to Ruby 2.4.0 and Rails 5.0.1.",

                   "Platform" : "linux",
                   "Technology" : "Ruby, Ruby on Rails, MySql"
                 },
                 {
                   "Project Name" : "StoryWeaver",
                   "Description" : "Storyweaver is managed by a non-profit organization called Pratham Books who has multiple donors including google and oracle. Storyweaver is an open digital platform for the users to read, create and translate stories in over 100+ languages. Users can upload their own paintings and weave a story around it or they can use our image bank which consists of more than 7000+ images. And users can download a story as pdf file and share on social websites.",
                   "Responsibilities" : "Provided support to various issues raising jira tickets for all the issues raised by Testing team.",
                   "Platform" : "linux",
                   "Technology" : "ruby on rails, postgres"
                 },
                 {
                   "Project Name" : "High Availability",
                   "Description" : "	A HA pair is two storage systems (nodes) whose controllers are connected to each other directly. In this configuration, one node can take over its partner's storage to provide continued data service if the partner goes down. The controllers are connected to each other through an HA interconnect. This allows one node to serve data that resides on the disks of its failed partner node.	Each node continually monitors its partner, mirroring the data for each other’s nonvolatile memory (NVRAM or NVMEM). The interconnect is internal and requires no external cabling if both controllers are in the same chassis. Takeover is the process in which a node takes over the storage of its partner. Giveback is the process in which that storage is returned to the partner. Both processes can be initiated manually or configured for automatic initiation.",
                   "Responsibilities" : "Responsible for validating Clustering features of ONTAP Operating System on NetApp SAN setup and logging defects., Validating/Execution of Manual test cases to meet Functional compliance., Executing the automated scripts and updating the logs., Bug Reporting and Verification",
                   "Platform" : "linux",
                   "Technology" : "storage, perl"
                 },
                 {
                   "Project Name" : "Process to Archive/Purge Files",
                   "Description" : "Based on the lifetime of files involved in MZ projects we can categorize the files into the following 4 groups and retain them with different storage. Transient files are temp files that are created during the daily load process. These are deleted by daily load process. Short Term files are files needed for daily load. Mid-term files are files we archive to a network attached storage (NAS) after daily load.  Production support will go back to these files if they need to search on them. These files are to be retained on NAS mounts. The following folder contains files that are to be tape archived for long term storage.",
                   "Responsibilities" : "The first of a new month the automation does zips up last month’s files.The folder becomes mzb_stagestores_archive_2015_Oct.gz. Move the .gz file to Tape_Pending folder on that mount storage and mzb_stagestores_archive_2015_Oct.gz file is going to storing the backup_paths table in Mysql database.",
                   "Platform" : "linux",
                   "Technology" : "perl, mysql"
                 }
               ],
  "Personal Details" : {
                         "Father Name": "Krishna Reddy Munagala",
                         "DOB" : "10-04-1993",
                         "Languages" : "english, telugu",
                         "Address" : "darsi, Ap",
                         "Marital Status" : "single"
                       }
};
